app/views/authors/index.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? ORDER BY "posts"."id" ASC LIMIT ?  [["author_id", 25], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 25]]
---
      <div>
        Post Count: <%= author.posts.count %>