app/views/authors/show.html.erb

  </tr>
  <% @author.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 25]]