app/controllers/authors_controller.rb

    def create
        @author = Author.new(author_params)

        if @author.save
---
INSERT INTO "authors" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "new"], ["description", "vkjgiuy"], ["created_at", "2022-07-15 09:23:49.411199"], ["updated_at", "2022-07-15 09:23:49.411199"]]

    def update
        @author = Author.find(params[:id])


        if @author.update(author_params)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "authors" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "I am Author"], ["description", "jguyoul"], ["updated_at", "2022-07-15 10:22:08.159050"], ["id", 1]]

    def destroy
        @author = Author.find(params[:id])
        @author.destroy
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 11]]