app/controllers/posts_controller.rb

INSERT INTO "posts" ("author_id", "title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_id", 25], ["title", "First Posts"], ["text", "hjjjjjjjjjjjj"], ["created_at", "2022-07-18 06:41:15.900876"], ["updated_at", "2022-07-18 06:41:15.900876"]]
---
  def create
      @post = Post.new(post_params)

      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "hjjjkkkkkkk"], ["updated_at", "2022-07-18 07:01:34.152919"], ["id", 1]]
---
  def update
      @post = Post.find(params[:id])


      if @post.update(post_params)